<?php

$bookName = "Тихий Дон";

$bookAuthor = "Михаил Шолохов";

$bookYear = 1928;

$bookDescription = "События: охватывают период с мая 1912 по март 1922 года. Основные события происходят на хуторе Татарском, в имении Ягодное, а также в Австрии, Восточной Пруссии, Санкт-Петербурге, Полесье, Новочеркасске, Миллерове и других населённых пунктах";

?>

<h1><?php echo $bookName; ?></h1>

<p>Автор: <?php echo $bookAuthor; ?></p>
<p>Год издания: <?php echo $bookYear; ?></p>

<p><?php echo $bookDescription; ?></p>
